clear; clc;
x = [0.5; 0.5];        % 初始点的位置
plot(x(1), x(2), '.'); % 绘制初始点
% 设置判断向量
h=[0.75, 0.90, 0.98, 1.00];
b1=[0; 1.5];
b2=[0; 1.5];
b3=[0; 0.4];
% 构造仿射变换矩阵
A1 = [0.75, 0.04; -0.04, 0.75];
A2 = [0.20, -0.3; 0.25, 0.23];
A3 = [-0.15, 0.32; 0.26, 0.24];
A4 = [0, 0; 0, 0.15];
%循环绘制
for i = 1 : 1000
    r = rand;
    if r < h(1)
        x = A1 * x + b1;
    elseif r < h(2)
        x = A2 * x + b2;
    elseif r < h(3)
        x = A3 * x + b3;
    else
        x = A4 * x;
    end
    plot(x(1), x(2), '.r'),
    hold on
end
hold off